#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
random_integer.name_suffix: Refreshing state... [id=38310]
azurerm_resource_group.app_service: Refreshing state... [id=/subscriptions/e7d488ae-94ab-4936-bc75-b2979545c893/resourceGroups/adolabs-38310]
azurerm_network_security_group.example: Refreshing state... [id=/subscriptions/e7d488ae-94ab-4936-bc75-b2979545c893/resourceGroups/adolabs-38310/providers/Microsoft.Network/networkSecurityGroups/example-security-group]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_container_app.example will be created
  + resource "azurerm_container_app" "example" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "example-app"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "adolabs-38310"
      + revision_mode                 = "Single"

      + template {
          + max_replicas                     = 10
          + min_replicas                     = 0
          + revision_suffix                  = (known after apply)
          + termination_grace_period_seconds = 0

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "mcr.microsoft.com/k8se/quickstart:latest"
              + memory            = "0.5Gi"
              + name              = "examplecontainerapp"
            }
        }
    }

  # azurerm_container_app_environment.example will be created
  + resource "azurerm_container_app_environment" "example" {
      + custom_domain_verification_id    = (known after apply)
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "eastus"
      + log_analytics_workspace_id       = (known after apply)
      + logs_destination                 = (known after apply)
      + mutual_tls_enabled               = false
      + name                             = "Example-Environment"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "adolabs-38310"
      + static_ip_address                = (known after apply)
      + zone_redundancy_enabled          = false
    }

  # azurerm_log_analytics_workspace.example will be created
  + resource "azurerm_log_analytics_workspace" "example" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = (known after apply)
      + local_authentication_enabled    = (known after apply)
      + location                        = "eastus"
      + name                            = "acctest-01"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "adolabs-38310"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + workspace_id                    = (known after apply)
    }

  # azurerm_network_security_group.example will be destroyed
  # (because azurerm_network_security_group.example is not in configuration)
  - resource "azurerm_network_security_group" "example" {
      - id                  = "/subscriptions/e7d488ae-94ab-4936-bc75-b2979545c893/resourceGroups/adolabs-38310/providers/Microsoft.Network/networkSecurityGroups/example-security-group" -> null
      - location            = "eastus" -> null
      - name                = "example-security-group" -> null
      - resource_group_name = "adolabs-38310" -> null
      - security_rule       = [] -> null
      - tags                = {} -> null
    }

Plan: 3 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @ssedor1, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*